---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.HvacEnergy
source: html/ff3595ab-d330-d7e5-8e37-2fb5696e463d.htm
---
# Autodesk.Revit.DB.SpecTypeId.HvacEnergy Property

Energy, in discipline Energy.

## Syntax (C#)
```csharp
public static ForgeTypeId HvacEnergy { get; }
```